#!/usr/bin/perl
use strict qw(subs vars);
#use warnings;
use lib '/home/engine/jlib';

use JConfig;
use JIO;
use JEML;
use JDBI;
use CMS;

###################################################################################################
# Начало работы
###################################################################################################

JIO->start();


JDBI->init();
JDBI->connect();
JDBI->dousers();

JEML->init();


JEML->doall();

#JDBI::dump_cache();

JDBI->destruct();

JIO->stop();

###################################################################################################
# Конец работы
###################################################################################################





